#pragma once

/**
 * Name: Ark_Survival_Evolved
 * Version: Patch_357.9
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsSpooderInSPACE
	 */
	struct ABogSpider_Character_BP_C_IsSpooderInSPACE_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_PD03[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnWallJump
	 */
	struct ABogSpider_Character_BP_C_OnWallJump_Params
	{
	public:
		struct FVector                                             wallJumpVelocity;                                        // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnClimberFinishedAttaching
	 */
	struct ABogSpider_Character_BP_C_OnClimberFinishedAttaching_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.StoreClimb Trace Socket Offsets
	 */
	struct ABogSpider_Character_BP_C_StoreClimbTraceSocketOffsets_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetSpiderClimbingTraceTransform
	 */
	struct ABogSpider_Character_BP_C_GetSpiderClimbingTraceTransform_Params
	{
	public:
		int32_t                                                    traceIndex;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bWorldSpace;                                             // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_NMPS[0xB];                                   // 0x0005(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct UObject_FTransform                                  TraceTransform;                                          // 0x0010(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsClimbingTraceHitResultValid
	 */
	struct ABogSpider_Character_BP_C_IsClimbingTraceHitResultValid_Params
	{
	public:
		bool                                                       bValidHit;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_8CTK[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FHitResult                                          Hit;                                                     // 0x0008(0x0088)  (Parm, OutParm, ReferenceParm)
		struct FVector                                             TraceStart;                                              // 0x0090(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             TraceEnd;                                                // 0x009C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    traceIndex;                                              // 0x00A8(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    TraceRetryNum;                                           // 0x00AC(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x00B0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanClimberOverrideRetriedTraceResult
	 */
	struct ABogSpider_Character_BP_C_CanClimberOverrideRetriedTraceResult_Params
	{
	public:
		struct FHitResult                                          WithHit;                                                 // 0x0000(0x0088)  (Parm, OutParm, ReferenceParm)
		bool                                                       bResult;                                                 // 0x0088(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanSpiderStopNonDediTick
	 */
	struct ABogSpider_Character_BP_C_CanSpiderStopNonDediTick_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HHGL[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanClimberStopNonDediTick_NonControlled
	 */
	struct ABogSpider_Character_BP_C_CanClimberStopNonDediTick_NonControlled_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanClimberStopNonDediTick_Controlled
	 */
	struct ABogSpider_Character_BP_C_CanClimberStopNonDediTick_Controlled_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Can ClimberContinueClimbing
	 */
	struct ABogSpider_Character_BP_C_CanClimberContinueClimbing_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanSpiderUseAbilities
	 */
	struct ABogSpider_Character_BP_C_CanSpiderUseAbilities_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UpdateSpiderRandomTickDelay
	 */
	struct ABogSpider_Character_BP_C_UpdateSpiderRandomTickDelay_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.StopAllSpiderCameraShake
	 */
	struct ABogSpider_Character_BP_C_StopAllSpiderCameraShake_Params
	{
	public:
		class APrimalCharacter*                                    ForRider;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UpdateNonControlledClimber
	 */
	struct ABogSpider_Character_BP_C_UpdateNonControlledClimber_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsPlayingJumpDetachAnim
	 */
	struct ABogSpider_Character_BP_C_IsPlayingJumpDetachAnim_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanPrimalCharBeUsedForTaming
	 */
	struct ABogSpider_Character_BP_C_CanPrimalCharBeUsedForTaming_Params
	{
	public:
		class APrimalCharacter*                                    Char;                                                    // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.AddTamingAffinityFromLifeSteal
	 */
	struct ABogSpider_Character_BP_C_AddTamingAffinityFromLifeSteal_Params
	{
	public:
		class AShooterCharacter*                                   ForPlayer;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPClientDoMultiUse
	 */
	struct ABogSpider_Character_BP_C_BPClientDoMultiUse_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ClientUseIndex;                                          // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.RefreshSpiderVision
	 */
	struct ABogSpider_Character_BP_C_RefreshSpiderVision_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_CacheWebTracePreviewHits
	 */
	struct ABogSpider_Character_BP_C_Tick_CacheWebTracePreviewHits_Params
	{
	public:
		TArray<struct FHitResult>                                  TraceHits;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CalcAirJumpVelocity
	 */
	struct ABogSpider_Character_BP_C_CalcAirJumpVelocity_Params
	{
	public:
		struct FVector2D                                           WithInputs;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             WithVelocity;                                            // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            WithControlRot;                                          // 0x0014(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0020(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPGetMultiUseEntries
	 */
	struct ABogSpider_Character_BP_C_BPGetMultiUseEntries_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		TArray<struct FMultiUseEntry>                              MultiUseEntries;                                         // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		TArray<struct FMultiUseEntry>                              ReturnValue;                                             // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetSpiderAnimBP
	 */
	struct ABogSpider_Character_BP_C_GetSpiderAnimBP_Params
	{
	public:
		class UBogSpider_AnimBlueprint_C*                          animBP;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.AddChargeJumpVelocity
	 */
	struct ABogSpider_Character_BP_C_AddChargeJumpVelocity_Params
	{
	public:
		float                                                      WithChargeRatio;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoChargeJump_Server
	 */
	struct ABogSpider_Character_BP_C_DoChargeJump_Server_Params
	{
	public:
		double                                                     ClientTimestamp;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.StartChargeJump_Server
	 */
	struct ABogSpider_Character_BP_C_StartChargeJump_Server_Params
	{
	public:
		double                                                     ClientTimestamp;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_UpdateClientWaterWalkingBuff
	 */
	struct ABogSpider_Character_BP_C_Tick_UpdateClientWaterWalkingBuff_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPAcknowledgeServerCorrection
	 */
	struct ABogSpider_Character_BP_C_BPAcknowledgeServerCorrection_Params
	{
	public:
		float                                                      TimeStamp;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             NewLoc;                                                  // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             NewVel;                                                  // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DKFR[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 NewBase;                                                 // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FName                                                NewBaseBoneName;                                         // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bHasBase;                                                // 0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bBaseRelativePosition;                                   // 0x0031(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              ServerMovementMode;                                      // 0x0032(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0033(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SpiderPrintShippingMessage
	 */
	struct ABogSpider_Character_BP_C_SpiderPrintShippingMessage_Params
	{
	public:
		class FString                                              Message;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPOnDinoCheat
	 */
	struct ABogSpider_Character_BP_C_BPOnDinoCheat_Params
	{
	public:
		class FName                                                CheatName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bSetValue;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_GC24[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      Value;                                                   // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BP_OverrideRiderCameraCollisionSweep
	 */
	struct ABogSpider_Character_BP_C_BP_OverrideRiderCameraCollisionSweep_Params
	{
	public:
		struct FVector                                             SweepStart;                                              // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FVector                                             SweepEnd;                                                // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FHitResult                                          ReturnValue;                                             // 0x0018(0x0088)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.AdjustClimbTraceTransform
	 */
	struct ABogSpider_Character_BP_C_AdjustClimbTraceTransform_Params
	{
	public:
		class FName                                                WithSocketName;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_A768[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct UObject_FTransform                                  WithTraceTransform;                                      // 0x0010(0x0030)  (Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
		struct UObject_FTransform                                  climberTransform;                                        // 0x0040(0x0030)  (Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
		struct UObject_FTransform                                  AdjustedTransform;                                       // 0x0070(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsRiderLookDirParallelWithClimbUp
	 */
	struct ABogSpider_Character_BP_C_IsRiderLookDirParallelWithClimbUp_Params
	{
	public:
		struct FVector2D                                           WithinAngleRange;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HW27[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      angleDelta;                                              // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetSpiderTransformForEnsnare
	 */
	struct ABogSpider_Character_BP_C_GetSpiderTransformForEnsnare_Params
	{
	public:
		struct UObject_FTransform                                  Transform;                                               // 0x0000(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BP_OverrideCarriedCharacterTransform
	 */
	struct ABogSpider_Character_BP_C_BP_OverrideCarriedCharacterTransform_Params
	{
	public:
		class APrimalCharacter*                                    ForCarriedChar;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.WantsToAirBrake
	 */
	struct ABogSpider_Character_BP_C_WantsToAirBrake_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UpdateClimberOverrideFallVelocity
	 */
	struct ABogSpider_Character_BP_C_UpdateClimberOverrideFallVelocity_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ModifySpiderFallingVelocity
	 */
	struct ABogSpider_Character_BP_C_ModifySpiderFallingVelocity_Params
	{
	public:
		struct FVector                                             Velocity;                                                // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		float                                                      DeltaTime;                                               // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Rotate RotatorForwardVector to Target Constant
	 */
	struct ABogSpider_Character_BP_C_RotateRotatorForwardVectortoTargetConstant_Params
	{
	public:
		struct FRotator                                            currentRotator;                                          // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             targetForward;                                           // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      RotationRate;                                            // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            newRotator;                                              // 0x001C(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetCurrentClimbingRotationSpeed
	 */
	struct ABogSpider_Character_BP_C_GetCurrentClimbingRotationSpeed_Params
	{
	public:
		float                                                      RotationSpeed;                                           // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Rotate Climber To TargetClimbingRotation
	 */
	struct ABogSpider_Character_BP_C_RotateClimberToTargetClimbingRotation_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPDidSetCarriedCharacter
	 */
	struct ABogSpider_Character_BP_C_BPDidSetCarriedCharacter_Params
	{
	public:
		class APrimalCharacter*                                    PreviousCarriedCharacter;                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_JMCS[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanClimberRestoreToSeeking
	 */
	struct ABogSpider_Character_BP_C_CanClimberRestoreToSeeking_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsSpiderClimbRunning
	 */
	struct ABogSpider_Character_BP_C_IsSpiderClimbRunning_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_1C0U[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_SimulateClimbingBetweenFrames
	 */
	struct ABogSpider_Character_BP_C_Tick_SimulateClimbingBetweenFrames_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsClimberGrounded
	 */
	struct ABogSpider_Character_BP_C_IsClimberGrounded_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPGetCrosshairColor
	 */
	struct ABogSpider_Character_BP_C_BPGetCrosshairColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Get CorrectDetachAnim
	 */
	struct ABogSpider_Character_BP_C_GetCorrectDetachAnim_Params
	{
	public:
		class UAnimMontage*                                        Anim;                                                    // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanSpiderRunSeek
	 */
	struct ABogSpider_Character_BP_C_CanSpiderRunSeek_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_UpdateSpiderRunSeeking
	 */
	struct ABogSpider_Character_BP_C_Tick_UpdateSpiderRunSeeking_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_UpdateSpiderCameraShake
	 */
	struct ABogSpider_Character_BP_C_Tick_UpdateSpiderCameraShake_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ClimberCheckForAboveWalkableGround
	 */
	struct ABogSpider_Character_BP_C_ClimberCheckForAboveWalkableGround_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_P7M8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Get Correct Surface Trace OffsetTransforms
	 */
	struct ABogSpider_Character_BP_C_GetCorrectSurfaceTraceOffsetTransforms_Params
	{
	public:
		bool                                                       overrideUseMap;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_5CJ2[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<bool>                                               newUseMp;                                                // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		TArray<struct UObject_FTransform>                          offsetTransforms;                                        // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor)
		TArray<int32_t>                                            TraceIndeces;                                            // 0x0028(0x0010)  (Parm, OutParm, ZeroConstructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DisplaySpiderHudNotification
	 */
	struct ABogSpider_Character_BP_C_DisplaySpiderHudNotification_Params
	{
	public:
		class FString                                              Notification;                                            // 0x0000(0x0010)  (Parm, ZeroConstructor)
		struct FLinearColor                                        Color;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector2D                                           DisplayScaleAndTime;                                     // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UTexture2D*                                          Icon;                                                    // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class USoundBase*                                          Sound;                                                   // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Tick_ManageBloodSuckingClientBuff
	 */
	struct ABogSpider_Character_BP_C_Tick_ManageBloodSuckingClientBuff_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UnriddenSpiderTryBioGrappleTarget
	 */
	struct ABogSpider_Character_BP_C_UnriddenSpiderTryBioGrappleTarget_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Climber_AllowMovementWhileClimbing
	 */
	struct ABogSpider_Character_BP_C_Climber_AllowMovementWhileClimbing_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Climber_AI_OnSetTarget
	 */
	struct ABogSpider_Character_BP_C_Climber_AI_OnSetTarget_Params
	{
	public:
		class AActor*                                              NewTarget;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UpdateClimbingClimber
	 */
	struct ABogSpider_Character_BP_C_UpdateClimbingClimber_Params
	{
	public:
		bool                                                       IgnoreFailure;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       canKeepClimbing;                                         // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SetSpiderVisionActive
	 */
	struct ABogSpider_Character_BP_C_SetSpiderVisionActive_Params
	{
	public:
		bool                                                       bNewActive;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ToggleSpiderVision
	 */
	struct ABogSpider_Character_BP_C_ToggleSpiderVision_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanClimberSeek
	 */
	struct ABogSpider_Character_BP_C_CanClimberSeek_Params
	{
	public:
		bool                                                       isForStart;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Result;                                                  // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Get CurrentClimbingVelocityMax
	 */
	struct ABogSpider_Character_BP_C_GetCurrentClimbingVelocityMax_Params
	{
	public:
		float                                                      Velocity;                                                // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Can Climber Rotate to Target Rotation
	 */
	struct ABogSpider_Character_BP_C_CanClimberRotatetoTargetRotation_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetClimbingMoveDirFromRotation
	 */
	struct ABogSpider_Character_BP_C_GetClimbingMoveDirFromRotation_Params
	{
	public:
		struct FRotator                                            Rotation;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             moveDir;                                                 // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CheckForUpdateSpiderClimbMoving
	 */
	struct ABogSpider_Character_BP_C_CheckForUpdateSpiderClimbMoving_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.UpdateClimber Inputs
	 */
	struct ABogSpider_Character_BP_C_UpdateClimberInputs_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Init Climber
	 */
	struct ABogSpider_Character_BP_C_InitClimber_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsNormalClimbable
	 */
	struct ABogSpider_Character_BP_C_IsNormalClimbable_Params
	{
	public:
		struct FVector                                             Normal;                                                  // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       isAverageNormal;                                         // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Result;                                                  // 0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_6LT5[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Replicate Index Update Server And Client Climber
	 */
	struct ABogSpider_Character_BP_C_ReplicateIndexUpdateServerAndClientClimber_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.Check For Prevent Stop Climbing
	 */
	struct ABogSpider_Character_BP_C_CheckForPreventStopClimbing_Params
	{
	public:
		TArray<bool>                                               traceHitsArray;                                          // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		int32_t                                                    numValidHits;                                            // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    numTraces;                                               // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       AllowClimbing;                                           // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetCorrectSurfaceTraceDistance
	 */
	struct ABogSpider_Character_BP_C_GetCorrectSurfaceTraceDistance_Params
	{
	public:
		bool                                                       isForRetry;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_MR85[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      traceDist;                                               // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.InterpolateClimberMesh
	 */
	struct ABogSpider_Character_BP_C_InterpolateClimberMesh_Params
	{
	public:
		class USkeletalMeshComponent*                              meshToInterpolate;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPOverrideCharacterNewFallVelocity
	 */
	struct ABogSpider_Character_BP_C_BPOverrideCharacterNewFallVelocity_Params
	{
	public:
		struct FVector                                             InitialVelocity;                                         // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FVector                                             Gravity;                                                 // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		float                                                      DeltaTime;                                               // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x001C(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsWebSprinting
	 */
	struct ABogSpider_Character_BP_C_IsWebSprinting_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.FireQuickWebs_Both
	 */
	struct ABogSpider_Character_BP_C_FireQuickWebs_Both_Params
	{
	public:
		struct FVector                                             WithHitLocation_A;                                       // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             WithHitLocation_B;                                       // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanQuickFireWebs
	 */
	struct ABogSpider_Character_BP_C_CanQuickFireWebs_Params
	{
	public:
		bool                                                       bSingle;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_D3UI[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.FireQuickWebs_Single
	 */
	struct ABogSpider_Character_BP_C_FireQuickWebs_Single_Params
	{
	public:
		struct FVector                                             WithHitLocation;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_K3MV[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class APrimalCharacter*                                    WithBioGrappleTarget;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoWebSearch_Both
	 */
	struct ABogSpider_Character_BP_C_DoWebSearch_Both_Params
	{
	public:
		struct FRotator                                            ViewRot;                                                 // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bFoundAny;                                               // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bFoundOne;                                               // 0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_O0WT[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             FoundHitLoc_A;                                           // 0x0010(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_BVFV[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              FoundHitActor_A;                                         // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             FoundHitLoc_B;                                           // 0x0028(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_4Q5V[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              FoundHitActor_B;                                         // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoWebSearch_Single
	 */
	struct ABogSpider_Character_BP_C_DoWebSearch_Single_Params
	{
	public:
		struct FRotator                                            ViewRot;                                                 // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bFoundHit;                                               // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_CA3W[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             FoundHitLoc;                                             // 0x0010(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_K3VS[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              FoundHitActor;                                           // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SetAirJumpVelocity
	 */
	struct ABogSpider_Character_BP_C_SetAirJumpVelocity_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoAirJump
	 */
	struct ABogSpider_Character_BP_C_DoAirJump_Params
	{
	public:
		struct FVector2D                                           WithMoveInputs;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             WithVelocity;                                            // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            WithControlRot;                                          // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanAirJump
	 */
	struct ABogSpider_Character_BP_C_CanAirJump_Params
	{
	public:
		bool                                                       bForStart;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.TryDoAirJump
	 */
	struct ABogSpider_Character_BP_C_TryDoAirJump_Params
	{
	public:
		struct FVector2D                                           WithMoveInputs;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             WithVelocity;                                            // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            WithControlRot;                                          // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanAttachWebsToCharInPVE
	 */
	struct ABogSpider_Character_BP_C_CanAttachWebsToCharInPVE_Params
	{
	public:
		class APrimalCharacter*                                    ToChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BreakWebVisually
	 */
	struct ABogSpider_Character_BP_C_BreakWebVisually_Params
	{
	public:
		bool                                                       bBreakLeft;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HFPM[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnWebTetherImpact
	 */
	struct ABogSpider_Character_BP_C_OnWebTetherImpact_Params
	{
	public:
		struct FHitResult                                          WithHit;                                                 // 0x0000(0x0088)  (Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsSpiderBloodHangry
	 */
	struct ABogSpider_Character_BP_C_IsSpiderBloodHangry_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.InterceptRiderEmoteAnim
	 */
	struct ABogSpider_Character_BP_C_InterceptRiderEmoteAnim_Params
	{
	public:
		class UAnimMontage*                                        EmoteAnim;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.NetSyncInputBitmask
	 */
	struct ABogSpider_Character_BP_C_NetSyncInputBitmask_Params
	{
	public:
		class FString                                              TriggeredByInput;                                        // 0x0000(0x0010)  (Parm, ZeroConstructor)
		bool                                                       bSuccess;                                                // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.IsBioGrappleOnCooldown
	 */
	struct ABogSpider_Character_BP_C_IsBioGrappleOnCooldown_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BP_OnStartCarried
	 */
	struct ABogSpider_Character_BP_C_BP_OnStartCarried_Params
	{
	public:
		class APrimalDinoCharacter*                                aDino;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnWebShootybangFailed
	 */
	struct ABogSpider_Character_BP_C_OnWebShootybangFailed_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.AddBioGrappledBuffToChar
	 */
	struct ABogSpider_Character_BP_C_AddBioGrappledBuffToChar_Params
	{
	public:
		class APrimalCharacter*                                    ToChar;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class APrimalBuff*                                         AddedBuff;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ReleaseEnsnaredChar
	 */
	struct ABogSpider_Character_BP_C_ReleaseEnsnaredChar_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnBioGrappledCharBreakWeb
	 */
	struct ABogSpider_Character_BP_C_OnBioGrappledCharBreakWeb_Params
	{
	public:
		class APrimalCharacter*                                    BreakingChar;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SetEnsnaredCharRef
	 */
	struct ABogSpider_Character_BP_C_SetEnsnaredCharRef_Params
	{
	public:
		class APrimalCharacter*                                    NewCharRef;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SetWebVisibility
	 */
	struct ABogSpider_Character_BP_C_SetWebVisibility_Params
	{
	public:
		bool                                                       bNewVisibility;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.StopSpiderJump
	 */
	struct ABogSpider_Character_BP_C_StopSpiderJump_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoRealSpiderJump
	 */
	struct ABogSpider_Character_BP_C_DoRealSpiderJump_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ShouldPreventWebShootWhileHoldingInputs
	 */
	struct ABogSpider_Character_BP_C_ShouldPreventWebShootWhileHoldingInputs_Params
	{
	public:
		bool                                                       bResult;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_2WLO[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.GetChargeJumpRatio
	 */
	struct ABogSpider_Character_BP_C_GetChargeJumpRatio_Params
	{
	public:
		float                                                      Ratio;                                                   // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_EVOP[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.OnKillEnsnaredDino
	 */
	struct ABogSpider_Character_BP_C_OnKillEnsnaredDino_Params
	{
	public:
		class APrimalDinoCharacter*                                KilledDino;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.ResetMeshRotation
	 */
	struct ABogSpider_Character_BP_C_ResetMeshRotation_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPOverrideCameraViewTarget
	 */
	struct ABogSpider_Character_BP_C_BPOverrideCameraViewTarget_Params
	{
	public:
		class FName                                                CurrentCameraMode;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             DesiredCameraLocation;                                   // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            DesiredCameraRotation;                                   // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DesiredFOV;                                              // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOverrideCameraLocation;                                 // 0x0024(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_EWN6[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             CameraLocation;                                          // 0x0028(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOverrideCameraRotation;                                 // 0x0034(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_MZYM[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FRotator                                            CameraRotation;                                          // 0x0038(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOverrideCameraFOV;                                      // 0x0044(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_1PAR[0x3];                                   // 0x0045(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      CameraFOV;                                               // 0x0048(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BPOverrideStencilAllianceForTarget
	 */
	struct ABogSpider_Character_BP_C_BPOverrideStencilAllianceForTarget_Params
	{
	public:
		class APrimalCharacter*                                    TargetDino;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UPrimitiveComponent*                                 Component;                                               // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		EStencilAlliance                                           ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_0CQM[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.BP_OverrideTerminalVelocity
	 */
	struct ABogSpider_Character_BP_C_BP_OverrideTerminalVelocity_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.SetImpendingLand
	 */
	struct ABogSpider_Character_BP_C_SetImpendingLand_Params
	{
	public:
		bool                                                       NewValue;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CanChargeJump
	 */
	struct ABogSpider_Character_BP_C_CanChargeJump_Params
	{
	public:
		bool                                                       bForStart;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bResult;                                                 // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.CancelChargeJump
	 */
	struct ABogSpider_Character_BP_C_CancelChargeJump_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.DoChargeJump_Client
	 */
	struct ABogSpider_Character_BP_C_DoChargeJump_Client_Params
	{	};

	/**
	 * Function BogSpider_Character_BP.BogSpider_Character_BP_C.StartChargeJump_Client
	 */
	struct ABogSpider_Character_BP_C_StartChargeJump_Client_Params
	{	};

