#pragma once

/**
 * Name: Ark_Survival_Evolved
 * Version: Patch_357.9
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.GetHudData
	 */
	struct ALionfishLion_Character_BP_C_GetHudData_Params
	{
	public:
		float                                                      AttackComboPercent;                                      // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      MaxComboFlashingSpeed;                                   // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		double                                                     LastUncloakTime;                                         // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      CloakCooldown;                                           // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsFemale;                                                // 0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsCamoActive;                                            // 0x0015(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_H39O[0x2];                                   // 0x0016(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     LastRoarBuffTime;                                        // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      RoarBuffCooldown;                                        // 0x0020(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       HasMateBoost;                                            // 0x0024(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_SN4M[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     LastTimeReleasedTeleport;                                // 0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      TeleportCooldown;                                        // 0x0030(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      TeleportPercent;                                         // 0x0034(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsCurrentlyChargingTeleport;                             // 0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HUO2[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class APrimalCharacter*                                    LatestQuickteleportTarget;                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      LeapCooldown;                                            // 0x0048(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_K7Z5[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     LastLeapTime;                                            // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      LeapPercent;                                             // 0x0058(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Keep Checking if the Fish Has Spawned
	 */
	struct ALionfishLion_Character_BP_C_KeepCheckingiftheFishHasSpawned_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.try feed shadowman on delay
	 */
	struct ALionfishLion_Character_BP_C_tryfeedshadowmanondelay_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Shortly After Falling Asleep Prevent Affinity Reset
	 */
	struct ALionfishLion_Character_BP_C_ShortlyAfterFallingAsleepPreventAffinityReset_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPPlayDying
	 */
	struct ALionfishLion_Character_BP_C_BPPlayDying_Params
	{
	public:
		float                                                      KillingDamage;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_B9GO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FDamageEvent                                        DamageEvent;                                             // 0x0008(0x0020)  (Parm, OutParm, ReferenceParm)
		class APawn*                                               InstigatingPawn;                                         // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AActor*                                              DamageCauser;                                            // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Is Lerping While Jumping
	 */
	struct ALionfishLion_Character_BP_C_IsLerpingWhileJumping_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Delay Reset Gravity
	 */
	struct ALionfishLion_Character_BP_C_DelayResetGravity_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.LFL Cloak Transition
	 */
	struct ALionfishLion_Character_BP_C_LFLCloakTransition_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.ReceivePossessed
	 */
	struct ALionfishLion_Character_BP_C_ReceivePossessed_Params
	{
	public:
		class AController*                                         NewController;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Lerp Camera During Jump
	 */
	struct ALionfishLion_Character_BP_C_LerpCameraDuringJump_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPCanTakePassenger
	 */
	struct ALionfishLion_Character_BP_C_BPCanTakePassenger_Params
	{
	public:
		class APrimalCharacter*                                    Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    PassengerSeatIndex;                                      // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForcePassenger;                                         // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bAllowFlyersAndWaterDinos;                               // 0x000D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x000E(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.is asleep
	 */
	struct ALionfishLion_Character_BP_C_isasleep_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPCanCryo
	 */
	struct ALionfishLion_Character_BP_C_BPCanCryo_Params
	{
	public:
		class AShooterPlayerController*                            ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_FYNH[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.IsPackLeader
	 */
	struct ALionfishLion_Character_BP_C_IsPackLeader_Params
	{
	public:
		bool                                                       bIsLeader;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_BTO2[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Display No Mate Boost Notification
	 */
	struct ALionfishLion_Character_BP_C_DisplayNoMateBoostNotification_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Prevented Interval to Check for Boss Dinos for Cloaking
	 */
	struct ALionfishLion_Character_BP_C_PreventedIntervaltoCheckforBossDinosforCloaking_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Is Near Boss
	 */
	struct ALionfishLion_Character_BP_C_IsNearBoss_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.ReceiveActorEndOverlap
	 */
	struct ALionfishLion_Character_BP_C_ReceiveActorEndOverlap_Params
	{
	public:
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.ReceiveActorBeginOverlap
	 */
	struct ALionfishLion_Character_BP_C_ReceiveActorBeginOverlap_Params
	{
	public:
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Decrease Camo Stamina
	 */
	struct ALionfishLion_Character_BP_C_DecreaseCamoStamina_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.can cloak
	 */
	struct ALionfishLion_Character_BP_C_cancloak_Params
	{
	public:
		class AActor*                                              InputPin;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_8Q76[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class APrimalCharacter*                                    AsPrimalCharacter;                                       // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Remove self as origin dino for cloaks
	 */
	struct ALionfishLion_Character_BP_C_Removeselfasorigindinoforcloaks_Params
	{
	public:
		class APrimalCharacter*                                    whogetsbuff;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.add cloak buff with self as origin
	 */
	struct ALionfishLion_Character_BP_C_addcloakbuffwithselfasorigin_Params
	{
	public:
		class APrimalCharacter*                                    whogetsbuff;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       forsolorider;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.OnRep_is solo camo active
	 */
	struct ALionfishLion_Character_BP_C_OnRep_issolocamoactive_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Show Quick Teleport Indicator
	 */
	struct ALionfishLion_Character_BP_C_ShowQuickTeleportIndicator_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Delay Check for Holding Down Crouch
	 */
	struct ALionfishLion_Character_BP_C_DelayCheckforHoldingDownCrouch_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Short Time After Initialization To Determine Targeting Team
	 */
	struct ALionfishLion_Character_BP_C_ShortTimeAfterInitializationToDetermineTargetingTeam_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Long Prevent Tamed Sleeping Timer
	 */
	struct ALionfishLion_Character_BP_C_LongPreventTamedSleepingTimer_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Has Fish Trap Ready
	 */
	struct ALionfishLion_Character_BP_C_HasFishTrapReady_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.spawn wild Inventory
	 */
	struct ALionfishLion_Character_BP_C_spawnwildInventory_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Spawn tamed inventory
	 */
	struct ALionfishLion_Character_BP_C_Spawntamedinventory_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Timeout Check To Determine If Rider Is Still Valid For Charging Big Spacebar Leap
	 */
	struct ALionfishLion_Character_BP_C_TimeoutCheckToDetermineIfRiderIsStillValidForChargingBigSpacebarLeap_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Timeout Check For Still Holding Spacebar
	 */
	struct ALionfishLion_Character_BP_C_TimeoutCheckForStillHoldingSpacebar_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Delay And Wake Up
	 */
	struct ALionfishLion_Character_BP_C_DelayAndWakeUp_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.delay and fall asleep
	 */
	struct ALionfishLion_Character_BP_C_delayandfallasleep_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Can Teleport Attack
	 */
	struct ALionfishLion_Character_BP_C_CanTeleportAttack_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_NHOG[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.spawn flame location on the ground
	 */
	struct ALionfishLion_Character_BP_C_spawnflamelocationontheground_Params
	{
	public:
		struct FVector                                             StartPoint;                                              // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             EndPoint;                                                // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPOnRefreshColorization
	 */
	struct ALionfishLion_Character_BP_C_BPOnRefreshColorization_Params
	{
	public:
		TArray<struct FLinearColor>                                Colors;                                                  // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Reset animbp anims to normal
	 */
	struct ALionfishLion_Character_BP_C_Resetanimbpanimstonormal_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.restrict wild teleport attacking
	 */
	struct ALionfishLion_Character_BP_C_restrictwildteleportattacking_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.shortly after fleeing from taming
	 */
	struct ALionfishLion_Character_BP_C_shortlyafterfleeingfromtaming_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.show particle over optimal teleport target
	 */
	struct ALionfishLion_Character_BP_C_showparticleoveroptimalteleporttarget_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.toggle max combo vfx on limbs
	 */
	struct ALionfishLion_Character_BP_C_togglemaxcombovfxonlimbs_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Restrict Max Combo Kill Fx
	 */
	struct ALionfishLion_Character_BP_C_RestrictMaxComboKillFx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.restrict bite fx
	 */
	struct ALionfishLion_Character_BP_C_restrictbitefx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Prep For Mouth Slash
	 */
	struct ALionfishLion_Character_BP_C_PrepForMouthSlash_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Prep For Left Paw Slash
	 */
	struct ALionfishLion_Character_BP_C_PrepForLeftPawSlash_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.prep for right paw slash
	 */
	struct ALionfishLion_Character_BP_C_prepforrightpawslash_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Is Landing From Big Spacebar Leap
	 */
	struct ALionfishLion_Character_BP_C_IsLandingFromBigSpacebarLeap_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPPreventFallDamage
	 */
	struct ALionfishLion_Character_BP_C_BPPreventFallDamage_Params
	{
	public:
		struct FHitResult                                          HitResult;                                               // 0x0000(0x0088)  (Parm, OutParm, ReferenceParm)
		float                                                      FallDamageAmount;                                        // 0x0088(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x008C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPShouldForceFlee
	 */
	struct ALionfishLion_Character_BP_C_BPShouldForceFlee_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.flee after feeding
	 */
	struct ALionfishLion_Character_BP_C_fleeafterfeeding_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.feed
	 */
	struct ALionfishLion_Character_BP_C_feed_Params
	{
	public:
		class APlayerController*                                   PC;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      FishWeight;                                              // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       cheatdebugbypass;                                        // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Fallback;                                                // 0x000D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DIJO[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.bite slash vfx
	 */
	struct ALionfishLion_Character_BP_C_biteslashvfx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.right paw slash vfx
	 */
	struct ALionfishLion_Character_BP_C_rightpawslashvfx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.left paw slash vfx
	 */
	struct ALionfishLion_Character_BP_C_leftpawslashvfx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.is able to be tamed
	 */
	struct ALionfishLion_Character_BP_C_isabletobetamed_Params
	{
	public:
		class APlayerController*                                   PC;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       cantame;                                                 // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_8GO2[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Text;                                                    // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPOverrideHurtAnim
	 */
	struct ALionfishLion_Character_BP_C_BPOverrideHurtAnim_Params
	{
	public:
		float                                                      DamageTaken;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_THII[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FDamageEvent                                        DamageEvent;                                             // 0x0008(0x0020)  (Parm, OutParm, ReferenceParm)
		class APawn*                                               PawnInstigator;                                          // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AActor*                                              DamageCauser;                                            // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIsLocalPath;                                            // 0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIsPointDamage;                                          // 0x0039(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_KLCQ[0x2];                                   // 0x003A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             PointDamageLocation;                                     // 0x003C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             PointDamageHitNormal;                                    // 0x0048(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_7UPA[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UAnimMontage*                                        ReturnValue;                                             // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Print String Manual
	 */
	struct ALionfishLion_Character_BP_C_PrintStringManual_Params
	{
	public:
		class FString                                              InString;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Stop Release Big Spacebar Leap Anims
	 */
	struct ALionfishLion_Character_BP_C_StopReleaseBigSpacebarLeapAnims_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.stop anim montage if playing
	 */
	struct ALionfishLion_Character_BP_C_stopanimmontageifplaying_Params
	{
	public:
		class UAnimMontage*                                        InputPin;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      BlendOut;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.get aerial rotation while pouncing
	 */
	struct ALionfishLion_Character_BP_C_getaerialrotationwhilepouncing_Params
	{
	public:
		struct FRotator                                            ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		struct FRotator                                            meshrot;                                                 // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.set up dynamic mats
	 */
	struct ALionfishLion_Character_BP_C_setupdynamicmats_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Has Found Multiple Targets
	 */
	struct ALionfishLion_Character_BP_C_HasFoundMultipleTargets_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Timer Check Teleport Targets
	 */
	struct ALionfishLion_Character_BP_C_TimerCheckTeleportTargets_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.save control rot
	 */
	struct ALionfishLion_Character_BP_C_savecontrolrot_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.retrieve control rot
	 */
	struct ALionfishLion_Character_BP_C_retrievecontrolrot_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Shortly After Tele
	 */
	struct ALionfishLion_Character_BP_C_ShortlyAfterTele_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Restrict Was Seen Requests
	 */
	struct ALionfishLion_Character_BP_C_RestrictWasSeenRequests_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.someone has line of sight to lion
	 */
	struct ALionfishLion_Character_BP_C_someonehaslineofsighttolion_Params
	{
	public:
		class AShooterPlayerController*                            PlayerController;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       NewParam;                                                // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_G5IT[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Check if Viewed by Players
	 */
	struct ALionfishLion_Character_BP_C_CheckifViewedbyPlayers_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Do Attack Cloak
	 */
	struct ALionfishLion_Character_BP_C_DoAttackCloak_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Request Charge Big Spacebar Leap
	 */
	struct ALionfishLion_Character_BP_C_ServerRequestChargeBigSpacebarLeap_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Request End Charge Big Spacebar Leap
	 */
	struct ALionfishLion_Character_BP_C_ServerRequestEndChargeBigSpacebarLeap_Params
	{
	public:
		struct FVector                                             helddirectioninputs;                                     // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_Z6U4[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UObject*                                             InputPin;                                                // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    A2;                                                      // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    InputPin2;                                               // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Request Jump
	 */
	struct ALionfishLion_Character_BP_C_ServerRequestJump_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Request Anim Start Jump
	 */
	struct ALionfishLion_Character_BP_C_ServerRequestAnimStartJump_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Requiest Crit Bite
	 */
	struct ALionfishLion_Character_BP_C_ServerRequiestCritBite_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Server Request Hold Teleport
	 */
	struct ALionfishLion_Character_BP_C_ServerRequestHoldTeleport_Params
	{
	public:
		struct FVector                                             viewdirection;                                           // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_UTNL[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UObject*                                             Target;                                                  // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       quicktapteleport;                                        // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_GP60[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BlueprintGetAttackWeight
	 */
	struct ALionfishLion_Character_BP_C_BlueprintGetAttackWeight_Params
	{
	public:
		int32_t                                                    AttackIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      inputWeight;                                             // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      Distance;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      attackRangeOffset;                                       // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AActor*                                              OtherTarget;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Add solo cloak buffs
	 */
	struct ALionfishLion_Character_BP_C_Addsolocloakbuffs_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.consolidated can attack
	 */
	struct ALionfishLion_Character_BP_C_consolidatedcanattack_Params
	{
	public:
		int32_t                                                    InputPin;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.
	 */
	struct ALionfishLion_Character_BP_C__Params
	{
	public:
		float                                                      _1;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      _2;                                                      // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      Output;                                                  // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Get Appropriate Extra Distance to Land In Front the Target from Current Position
	 */
	struct ALionfishLion_Character_BP_C_GetAppropriateExtraDistancetoLandInFronttheTargetfromCurrentPosition_Params
	{
	public:
		struct FVector                                             currentlocation;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_YNV9[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Enemy;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DGCX[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Is Teleport End Location Blocked
	 */
	struct ALionfishLion_Character_BP_C_IsTeleportEndLocationBlocked_Params
	{
	public:
		struct FVector                                             Start;                                                   // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             End;                                                     // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FHitResult                                          OutHit;                                                  // 0x0018(0x0088)  (Parm, OutParm)
		bool                                                       ReturnValue;                                             // 0x00A0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_XS7V[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Get Desired Teleport Final Location In Front Of the Enemy
	 */
	struct ALionfishLion_Character_BP_C_GetDesiredTeleportFinalLocationInFrontOftheEnemy_Params
	{
	public:
		struct FVector                                             currentposition;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_SDW8[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Enemy;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             finallocation;                                           // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Check If The LFL Can Physically Fit To The Teleport Target
	 */
	struct ALionfishLion_Character_BP_C_CheckIfTheLFLCanPhysicallyFitToTheTeleportTarget_Params
	{
	public:
		struct FVector                                             Start;                                                   // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             End;                                                     // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       doublecheckedandallclear;                                // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.disable tele targeting vfx
	 */
	struct ALionfishLion_Character_BP_C_disableteletargetingvfx_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.OnRep_is sleeping state
	 */
	struct ALionfishLion_Character_BP_C_OnRep_issleepingstate_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.spawn cloaked footstep
	 */
	struct ALionfishLion_Character_BP_C_spawncloakedfootstep_Params
	{
	public:
		class UParticleSystem*                                     EmitterTemplate;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            Rotation;                                                // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             InputPin;                                                // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPDinoTooltipCustomTamingProgressBar
	 */
	struct ALionfishLion_Character_BP_C_BPDinoTooltipCustomTamingProgressBar_Params
	{
	public:
		bool                                                       overrideTamingProgressBarIfActive;                       // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_55DU[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      progressPercent;                                         // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FString                                              Label;                                                   // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPOnTamedProcessOrder
	 */
	struct ALionfishLion_Character_BP_C_BPOnTamedProcessOrder_Params
	{
	public:
		class APrimalCharacter*                                    FromCharacter;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		EDinoTamedOrder                                            OrderType;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForce;                                                  // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_0FRV[0x6];                                   // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              enemyTarget;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       orderNotExecuted;                                        // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.cooldown after action before being able to sleep
	 */
	struct ALionfishLion_Character_BP_C_cooldownafteractionbeforebeingabletosleep_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BP_OnTamedOrderReceived
	 */
	struct ALionfishLion_Character_BP_C_BP_OnTamedOrderReceived_Params
	{
	public:
		class APrimalCharacter*                                    FromCharacter;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		EDinoTamedOrder                                            OrderType;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForce;                                                  // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_I3HA[0x6];                                   // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              enemyTarget;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       orderNotExecuted;                                        // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Prevent Tamed Sleeping Timer
	 */
	struct ALionfishLion_Character_BP_C_PreventTamedSleepingTimer_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPGetMultiUseEntries
	 */
	struct ALionfishLion_Character_BP_C_BPGetMultiUseEntries_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		TArray<struct FMultiUseEntry>                              MultiUseEntries;                                         // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		TArray<struct FMultiUseEntry>                              ReturnValue;                                             // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.multiuse logic
	 */
	struct ALionfishLion_Character_BP_C_multiuselogic_Params
	{
	public:
		TArray<struct FMultiUseEntry>                              localmultiuse;                                           // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		class APlayerController*                                   PC;                                                      // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		TArray<struct FMultiUseEntry>                              returnmultiuse;                                          // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.BPClientDoMultiUse
	 */
	struct ALionfishLion_Character_BP_C_BPClientDoMultiUse_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ClientUseIndex;                                          // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Natural Armor Defense Amount Calculation
	 */
	struct ALionfishLion_Character_BP_C_NaturalArmorDefenseAmountCalculation_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Set up Natural Armor value based on level
	 */
	struct ALionfishLion_Character_BP_C_SetupNaturalArmorvaluebasedonlevel_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.attempt to set up natural armor
	 */
	struct ALionfishLion_Character_BP_C_attempttosetupnaturalarmor_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.teleport stun duration calculation
	 */
	struct ALionfishLion_Character_BP_C_teleportstundurationcalculation_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Time Threshold for Determining Held Bite
	 */
	struct ALionfishLion_Character_BP_C_TimeThresholdforDeterminingHeldBite_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Short Time After Ending Teleport
	 */
	struct ALionfishLion_Character_BP_C_ShortTimeAfterEndingTeleport_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.tele attack object types
	 */
	struct ALionfishLion_Character_BP_C_teleattackobjecttypes_Params
	{
	public:
		TArray<EObjectTypeQuery>                                   Array;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.straight line teleport charge move detection sphere
	 */
	struct ALionfishLion_Character_BP_C_straightlineteleportchargemovedetectionsphere_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.detect targets in a straight line over time
	 */
	struct ALionfishLion_Character_BP_C_detecttargetsinastraightlineovertime_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Identify Best Aimed Target For Quickteleport - Clientside
	 */
	struct ALionfishLion_Character_BP_C_IdentifyBestAimedTargetForQuickteleportClientside_Params
	{
	public:
		class APrimalCharacter*                                    Character;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.set dino and rider hidden
	 */
	struct ALionfishLion_Character_BP_C_setdinoandriderhidden_Params
	{
	public:
		bool                                                       Hidden;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_IHF4[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      PlayRate;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       dontreversefromend;                                      // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Is Valid Teleport Target 
	 */
	struct ALionfishLion_Character_BP_C_IsValidTeleportTarget_Params
	{
	public:
		class APrimalCharacter*                                    Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ishudelemcheck;                                          // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_0N3X[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             teleporttracespherelocation;                             // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       cantarget;                                               // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DULQ[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.set final location and rotation after teleport
	 */
	struct ALionfishLion_Character_BP_C_setfinallocationandrotationafterteleport_Params
	{
	public:
		struct FVector                                             startloc;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             endloc;                                                  // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       turnaround;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_GARZ[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.damage teleport target
	 */
	struct ALionfishLion_Character_BP_C_damageteleporttarget_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.prepare LFL for teleporting to target
	 */
	struct ALionfishLion_Character_BP_C_prepareLFLforteleportingtotarget_Params
	{
	public:
		struct FVector                                             End;                                                     // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             Start;                                                   // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.is line of sight to target blocked
	 */
	struct ALionfishLion_Character_BP_C_islineofsighttotargetblocked_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Debug;                                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_PZQ6[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             fromspecificlocation;                                    // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       simplecheck;                                             // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bLocked;                                                 // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.get rotation to face opponent
	 */
	struct ALionfishLion_Character_BP_C_getrotationtofaceopponent_Params
	{
	public:
		struct FVector                                             currentlocation;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_609T[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Enemy;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FRotator                                            ReturnValue;                                             // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Get Desired Teleport Final Location Behind The Enemy
	 */
	struct ALionfishLion_Character_BP_C_GetDesiredTeleportFinalLocationBehindTheEnemy_Params
	{
	public:
		struct FVector                                             currentposition;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_UZEG[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Enemy;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             finallocation;                                           // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.get appropriate extra distance to land behind the target from current position
	 */
	struct ALionfishLion_Character_BP_C_getappropriateextradistancetolandbehindthetargetfromcurrentposition_Params
	{
	public:
		struct FVector                                             currentlocation;                                         // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_REOU[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Enemy;                                                   // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_LZAI[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.request release charge teleport
	 */
	struct ALionfishLion_Character_BP_C_requestreleasechargeteleport_Params
	{
	public:
		bool                                                       IsQuickTapTeleport;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_Y725[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Sort Selected Teleport Targets By Distance From Center
	 */
	struct ALionfishLion_Character_BP_C_SortSelectedTeleportTargetsByDistanceFromCenter_Params
	{	};

	/**
	 * Function LionfishLion_Character_BP.LionfishLion_Character_BP_C.Select Next Teleport Target While Charging
	 */
	struct ALionfishLion_Character_BP_C_SelectNextTeleportTargetWhileCharging_Params
	{	};

	/**
