#pragma once

/**
 * Name: Ark_Survival_Evolved
 * Version: Patch_357.9
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetHudData
	 */
	struct ASpaceDolphin_Character_BP_C_GetHudData_Params
	{
	public:
		bool                                                       HasSaddle;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsFPV;                                                   // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       HideHUDinFPV;                                            // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_K5Y1[0x1];                                   // 0x0003(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    LaserLevel;                                              // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    MaxLaserLevel;                                           // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      LaserDowngradeTime;                                      // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      LaserDowngradeTimerRemaining;                            // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsLaserDowngradeTimerActive;                             // 0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_VIX6[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     LastLaserLevelChangedTime;                               // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UPrimalInventoryComponent*                           InventoryComponent;                                      // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UClass*                                              SaddleFuelItem;                                          // 0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UClass*                                              FlakCannonAmmoItem;                                      // 0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsUsingSuperFlight;                                      // 0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsUsingSuperFlightBoost;                                 // 0x0039(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_7TDO[0x2];                                   // 0x003A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      FuelPercent;                                             // 0x003C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      CannonCooldownPercent;                                   // 0x0040(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      EchoOrChaffCooldownPercent;                              // 0x0044(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsSubmerged;                                             // 0x0048(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_RXDH[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPClientHandleNetExecCommand
	 */
	struct ASpaceDolphin_Character_BP_C_BPClientHandleNetExecCommand_Params
	{
	public:
		class FName                                                CommandName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FBPNetExecParams                                    ExecParams;                                              // 0x0008(0x0040)  (Parm, OutParm, ReferenceParm)
		class APlayerController*                                   ForPC;                                                   // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0050(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.CheckVelocityError
	 */
	struct ASpaceDolphin_Character_BP_C_CheckVelocityError_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPForceCameraStyle
	 */
	struct ASpaceDolphin_Character_BP_C_BPForceCameraStyle_Params
	{
	public:
		class APrimalCharacter*                                    ForViewTarget;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		ECameraStyle                                               ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateLocalSounds
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateLocalSounds_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Is Star Fox Mode Public
	 */
	struct ASpaceDolphin_Character_BP_C_IsStarFoxModePublic_Params
	{
	public:
		class AMissionSpline*                                      CurrentSpline;                                           // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HOHE[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     RetRiderSetTime;                                         // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       RetIsRiderWarmup;                                        // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_RIMV[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateMouseCursor
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateMouseCursor_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.TurnOffMouseCursor
	 */
	struct ASpaceDolphin_Character_BP_C_TurnOffMouseCursor_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPHandlePoop
	 */
	struct ASpaceDolphin_Character_BP_C_BPHandlePoop_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsSilenced
	 */
	struct ASpaceDolphin_Character_BP_C_IsSilenced_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_A2IX[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Server Request Fire Lasers Fn
	 */
	struct ASpaceDolphin_Character_BP_C_ServerRequestFireLasersFn_Params
	{
	public:
		struct FVector                                             CameraHitLocation;                                       // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ShouldPreventLockOnMe
	 */
	struct ASpaceDolphin_Character_BP_C_ShouldPreventLockOnMe_Params
	{
	public:
		bool                                                       IsPrevented;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_R9OF[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsCurrentlyInStarFoxModeWithGamepad
	 */
	struct ASpaceDolphin_Character_BP_C_IsCurrentlyInStarFoxModeWithGamepad_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_BCMC[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPSetSimulatedInterpRollOverride
	 */
	struct ASpaceDolphin_Character_BP_C_BPSetSimulatedInterpRollOverride_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsGamePadActive
	 */
	struct ASpaceDolphin_Character_BP_C_IsGamePadActive_Params
	{
	public:
		bool                                                       Ret;                                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HN8B[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPUnstasis
	 */
	struct ASpaceDolphin_Character_BP_C_BPUnstasis_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.TryStartImmelmann
	 */
	struct ASpaceDolphin_Character_BP_C_TryStartImmelmann_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.TryStartLoop
	 */
	struct ASpaceDolphin_Character_BP_C_TryStartLoop_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateFPVMeshes
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateFPVMeshes_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Get Desired Rotation
	 */
	struct ASpaceDolphin_Character_BP_C_GetDesiredRotation_Params
	{
	public:
		struct FRotator                                            ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetCameraHitLocationForProjectiles
	 */
	struct ASpaceDolphin_Character_BP_C_GetCameraHitLocationForProjectiles_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Get Screen Mouse Position as MatParam
	 */
	struct ASpaceDolphin_Character_BP_C_GetScreenMousePositionasMatParam_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPOnClearMountedDino
	 */
	struct ASpaceDolphin_Character_BP_C_BPOnClearMountedDino_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Update Saddle Shield Material
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateSaddleShieldMaterial_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetPercentTamed
	 */
	struct ASpaceDolphin_Character_BP_C_GetPercentTamed_Params
	{
	public:
		float                                                      Percemt;                                                 // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      RequiredAmount;                                          // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPDinoTooltipCustomTamingProgressBar
	 */
	struct ASpaceDolphin_Character_BP_C_BPDinoTooltipCustomTamingProgressBar_Params
	{
	public:
		bool                                                       overrideTamingProgressBarIfActive;                       // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_5RAU[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      progressPercent;                                         // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FString                                              Label;                                                   // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_H2QU[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPNotifyInventoryItemChange
	 */
	struct ASpaceDolphin_Character_BP_C_BPNotifyInventoryItemChange_Params
	{
	public:
		bool                                                       bIsItemAdd;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_5P3X[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimalItem*                                         theItem;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bEquipItem;                                              // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_FY0V[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.AddSaddleActivationText
	 */
	struct ASpaceDolphin_Character_BP_C_AddSaddleActivationText_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ClearSaddleActivationText
	 */
	struct ASpaceDolphin_Character_BP_C_ClearSaddleActivationText_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPBecomeAdult
	 */
	struct ASpaceDolphin_Character_BP_C_BPBecomeAdult_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPBecomeBaby
	 */
	struct ASpaceDolphin_Character_BP_C_BPBecomeBaby_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateStarFoxCameraForGamepad
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateStarFoxCameraForGamepad_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BP_InterceptTurnInput
	 */
	struct ASpaceDolphin_Character_BP_C_BP_InterceptTurnInput_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_9MQ7[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.OnConsumeFood
	 */
	struct ASpaceDolphin_Character_BP_C_OnConsumeFood_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPUntamedConsumeFoodItem
	 */
	struct ASpaceDolphin_Character_BP_C_BPUntamedConsumeFoodItem_Params
	{
	public:
		class UPrimalItem*                                         foodItem;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPTamedConsumeFoodItem
	 */
	struct ASpaceDolphin_Character_BP_C_BPTamedConsumeFoodItem_Params
	{
	public:
		class UPrimalItem*                                         foodItem;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPModifyControlRotation
	 */
	struct ASpaceDolphin_Character_BP_C_BPModifyControlRotation_Params
	{
	public:
		struct FRotator                                            ControlRotation;                                         // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FRotator                                            outControlRotation;                                      // 0x000C(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_UKZJ[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.SetLastTimeChargedLaserHit
	 */
	struct ASpaceDolphin_Character_BP_C_SetLastTimeChargedLaserHit_Params
	{
	public:
		double                                                     val;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Update Materials
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateMaterials_Params
	{
	public:
		class UMaterialInterface*                                  Material;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Is FPV Public
	 */
	struct ASpaceDolphin_Character_BP_C_IsFPVPublic_Params
	{
	public:
		bool                                                       Retval;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DUCE[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsFPV
	 */
	struct ASpaceDolphin_Character_BP_C_IsFPV_Params
	{
	public:
		bool                                                       Retval;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_5NT1[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             CameraLoc;                                               // 0x0004(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ReceiveEndPlay
	 */
	struct ASpaceDolphin_Character_BP_C_ReceiveEndPlay_Params
	{
	public:
		EEndPlayReason                                             EndPlayReason;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPNotifyLevelUp
	 */
	struct ASpaceDolphin_Character_BP_C_BPNotifyLevelUp_Params
	{
	public:
		int32_t                                                    ExtraCharacterLevel;                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_0505[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsSpinningPublic
	 */
	struct ASpaceDolphin_Character_BP_C_IsSpinningPublic_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		bool                                                       Right;                                                   // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateBarrelRoll
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateBarrelRoll_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetLaserDamage
	 */
	struct ASpaceDolphin_Character_BP_C_GetLaserDamage_Params
	{
	public:
		class AActor*                                              HitActor;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetDamageReductionPercentFromLaserLevel
	 */
	struct ASpaceDolphin_Character_BP_C_GetDamageReductionPercentFromLaserLevel_Params
	{
	public:
		float                                                      Ret;                                                     // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetTamedWalkingSpeedModifierForLaserLevel
	 */
	struct ASpaceDolphin_Character_BP_C_GetTamedWalkingSpeedModifierForLaserLevel_Params
	{
	public:
		float                                                      TamedWalkingSpeedModifier;                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetLaserLevelDowngradeTime
	 */
	struct ASpaceDolphin_Character_BP_C_GetLaserLevelDowngradeTime_Params
	{
	public:
		float                                                      LaserLevelDowngradeTime;                                 // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetChargedLaserProj
	 */
	struct ASpaceDolphin_Character_BP_C_GetChargedLaserProj_Params
	{
	public:
		class UClass*                                              ChargedLaserProjectile;                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetLaserPFX
	 */
	struct ASpaceDolphin_Character_BP_C_GetLaserPFX_Params
	{
	public:
		int32_t                                                    LaserLevel;                                              // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_9ONU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UParticleSystem*                                     ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPGetTargetingDesirability
	 */
	struct ASpaceDolphin_Character_BP_C_BPGetTargetingDesirability_Params
	{
	public:
		class AActor*                                              Attacker;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetChanceToSpawnSpaceWhale
	 */
	struct ASpaceDolphin_Character_BP_C_GetChanceToSpawnSpaceWhale_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.SpawnSpaceWhale
	 */
	struct ASpaceDolphin_Character_BP_C_SpawnSpaceWhale_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Try Spawn Space Whale
	 */
	struct ASpaceDolphin_Character_BP_C_TrySpawnSpaceWhale_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateWildDemands
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateWildDemands_Params
	{
	public:
		bool                                                       ResetWildDemand;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_1IJK[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.HasWildDemands
	 */
	struct ASpaceDolphin_Character_BP_C_HasWildDemands_Params
	{
	public:
		bool                                                       HasDemands;                                              // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_0JEK[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    NumPets;                                                 // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    NumFood;                                                 // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.TriggerWildAngerFn
	 */
	struct ASpaceDolphin_Character_BP_C_TriggerWildAngerFn_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsAngryWildDino
	 */
	struct ASpaceDolphin_Character_BP_C_IsAngryWildDino_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_ZYWZ[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      DistanceSq;                                              // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.NearbyAngryDolphin
	 */
	struct ASpaceDolphin_Character_BP_C_NearbyAngryDolphin_Params
	{
	public:
		class ASpaceDolphin_Character_BP_C*                        AngryDolphin;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AShooterCharacter*                                   Target;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPShouldForceFlee
	 */
	struct ASpaceDolphin_Character_BP_C_BPShouldForceFlee_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateWild
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateWild_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPTryMultiUse
	 */
	struct ASpaceDolphin_Character_BP_C_BPTryMultiUse_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    UseIndex;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPGetMultiUseEntries
	 */
	struct ASpaceDolphin_Character_BP_C_BPGetMultiUseEntries_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		TArray<struct FMultiUseEntry>                              MultiUseEntries;                                         // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
		TArray<struct FMultiUseEntry>                              ReturnValue;                                             // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BlueprintAdjustOutputDamage
	 */
	struct ASpaceDolphin_Character_BP_C_BlueprintAdjustOutputDamage_Params
	{
	public:
		int32_t                                                    AttackIndex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      OriginalDamageAmount;                                    // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AActor*                                              HitActor;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UClass*                                              OutDamageType;                                           // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      OutDamageImpulse;                                        // 0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x001C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.FireChaff
	 */
	struct ASpaceDolphin_Character_BP_C_FireChaff_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.EchoLocation
	 */
	struct ASpaceDolphin_Character_BP_C_EchoLocation_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateGroundFX
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateGroundFX_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.DoLaserTraceAndDamage
	 */
	struct ASpaceDolphin_Character_BP_C_DoLaserTraceAndDamage_Params
	{
	public:
		struct FVector                                             Start;                                                   // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             End;                                                     // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             RetStart;                                                // 0x0018(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             RetEnd;                                                  // 0x0024(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Ret;                                                     // 0x0030(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ImpactCharacterOrStructure;                              // 0x0031(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HB60[0x6];                                   // 0x0032(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateStarFoxCollision
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateStarFoxCollision_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpateBarrelRollFX
	 */
	struct ASpaceDolphin_Character_BP_C_UpateBarrelRollFX_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateRotatingComponent
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateRotatingComponent_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.OnRep_LastLaserLevelUpTime
	 */
	struct ASpaceDolphin_Character_BP_C_OnRep_LastLaserLevelUpTime_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Downgrade Laser Level
	 */
	struct ASpaceDolphin_Character_BP_C_DowngradeLaserLevel_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Is Drifting Public
	 */
	struct ASpaceDolphin_Character_BP_C_IsDriftingPublic_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		bool                                                       DriftingInput;                                           // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Right;                                                   // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_CX01[0x5];                                   // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     DriftEndTime;                                            // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.DeactiveDriftJets
	 */
	struct ASpaceDolphin_Character_BP_C_DeactiveDriftJets_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsDrifting
	 */
	struct ASpaceDolphin_Character_BP_C_IsDrifting_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		bool                                                       DriftingInput;                                           // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       Right;                                                   // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_VMTG[0x5];                                   // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     DriftEndTime;                                            // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       IsFinishingDrift;                                        // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_S87J[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetDriftInputStrength
	 */
	struct ASpaceDolphin_Character_BP_C_GetDriftInputStrength_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		float                                                      ReturnValueBase;                                         // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateDrifting
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateDrifting_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateSaddle
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateSaddle_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.TryDoStarFoxModeCollisionDamage
	 */
	struct ASpaceDolphin_Character_BP_C_TryDoStarFoxModeCollisionDamage_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ReceiveActorBeginOverlap
	 */
	struct ASpaceDolphin_Character_BP_C_ReceiveActorBeginOverlap_Params
	{
	public:
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ReceiveActorEndOverlap
	 */
	struct ASpaceDolphin_Character_BP_C_ReceiveActorEndOverlap_Params
	{
	public:
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Get Camera YScalar
	 */
	struct ASpaceDolphin_Character_BP_C_GetCameraYScalar_Params
	{
	public:
		float                                                      StarFoxModeCameraXOffsetScalar;                          // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_AHBC[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.OnRep_CurrentSpline
	 */
	struct ASpaceDolphin_Character_BP_C_OnRep_CurrentSpline_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BP_PreventMovementMode
	 */
	struct ASpaceDolphin_Character_BP_C_BP_PreventMovementMode_Params
	{
	public:
		EMovementMode                                              NewMovementMode;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              NewCustomMode;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.CanBarrelRoll
	 */
	struct ASpaceDolphin_Character_BP_C_CanBarrelRoll_Params
	{
	public:
		bool                                                       res;                                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HSHS[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsDoingBarrelRoll
	 */
	struct ASpaceDolphin_Character_BP_C_IsDoingBarrelRoll_Params
	{
	public:
		bool                                                       Ret;                                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_23FE[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UAnimMontage*                                        Anim;                                                    // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		double                                                     LastBarrelRollStartTime;                                 // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BarrelRoll
	 */
	struct ASpaceDolphin_Character_BP_C_BarrelRoll_Params
	{
	public:
		int32_t                                                    Direction;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             CameraDirection;                                         // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Is Braking Public
	 */
	struct ASpaceDolphin_Character_BP_C_IsBrakingPublic_Params
	{
	public:
		bool                                                       IsBraking;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_XHWN[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     TimeStartedBraking;                                      // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Is Braking
	 */
	struct ASpaceDolphin_Character_BP_C_IsBraking_Params
	{
	public:
		bool                                                       IsBraking;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_GFT4[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     TimeStartedBraking;                                      // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateBraking
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateBraking_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPDrawToRiderHUD
	 */
	struct ASpaceDolphin_Character_BP_C_BPDrawToRiderHUD_Params
	{
	public:
		class AShooterHUD*                                         HUD;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateSpinning
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateSpinning_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsSpinning
	 */
	struct ASpaceDolphin_Character_BP_C_IsSpinning_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		bool                                                       Right;                                                   // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.DestroyProjectile
	 */
	struct ASpaceDolphin_Character_BP_C_DestroyProjectile_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Get Flak Cannon Parameters
	 */
	struct ASpaceDolphin_Character_BP_C_GetFlakCannonParameters_Params
	{
	public:
		class AShooterProjectile*                                  Projectile;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsStarFoxMode
	 */
	struct ASpaceDolphin_Character_BP_C_IsStarFoxMode_Params
	{
	public:
		class AMissionSpline*                                      CurrentSpline;                                           // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_CM9M[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     RetRiderSetTime;                                         // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       RetIsRiderWarmup;                                        // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_EXQE[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.ValidateSpline
	 */
	struct ASpaceDolphin_Character_BP_C_ValidateSpline_Params
	{
	public:
		class AMissionSpline*                                      Spline;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateSpline
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateSpline_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPServerHandleNetExecCommand
	 */
	struct ASpaceDolphin_Character_BP_C_BPServerHandleNetExecCommand_Params
	{
	public:
		class APlayerController*                                   FromPC;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FName                                                CommandName;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FBPNetExecParams                                    ExecParams;                                              // 0x0010(0x0040)  (Parm, OutParm, ReferenceParm)
		bool                                                       ReturnValue;                                             // 0x0050(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPKilledSomethingEvent
	 */
	struct ASpaceDolphin_Character_BP_C_BPKilledSomethingEvent_Params
	{
	public:
		class APrimalCharacter*                                    killedTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsDualLasers
	 */
	struct ASpaceDolphin_Character_BP_C_IsDualLasers_Params
	{
	public:
		bool                                                       DualLasers;                                              // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.CanLoop
	 */
	struct ASpaceDolphin_Character_BP_C_CanLoop_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.IsChargingLaser
	 */
	struct ASpaceDolphin_Character_BP_C_IsChargingLaser_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_Y74J[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPGetCrosshairSpread
	 */
	struct ASpaceDolphin_Character_BP_C_BPGetCrosshairSpread_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.UpdateLoop
	 */
	struct ASpaceDolphin_Character_BP_C_UpdateLoop_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPAcknowledgeServerCorrection
	 */
	struct ASpaceDolphin_Character_BP_C_BPAcknowledgeServerCorrection_Params
	{
	public:
		float                                                      TimeStamp;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             NewLoc;                                                  // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             NewVel;                                                  // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_YF2A[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 NewBase;                                                 // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FName                                                NewBaseBoneName;                                         // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bHasBase;                                                // 0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bBaseRelativePosition;                                   // 0x0031(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              ServerMovementMode;                                      // 0x0032(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0033(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.EndLoop
	 */
	struct ASpaceDolphin_Character_BP_C_EndLoop_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.StartLoop
	 */
	struct ASpaceDolphin_Character_BP_C_StartLoop_Params
	{
	public:
		bool                                                       Immelmann;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.BPGetCrosshairColor
	 */
	struct ASpaceDolphin_Character_BP_C_BPGetCrosshairColor_Params
	{
	public:
		struct FLinearColor                                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.Try Get ChargedLaserTarget
	 */
	struct ASpaceDolphin_Character_BP_C_TryGetChargedLaserTarget_Params
	{
	public:
		class AActor*                                              Ret;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.OwningClientTryFireChargedLaser
	 */
	struct ASpaceDolphin_Character_BP_C_OwningClientTryFireChargedLaser_Params
	{	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.GetChargedLaserParameters
	 */
	struct ASpaceDolphin_Character_BP_C_GetChargedLaserParameters_Params
	{
	public:
		class AShooterProjectile*                                  Projectile;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ChargeTime;                                              // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_N80X[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Target;                                                  // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SpaceDolphin_Character_BP.SpaceDolphin_Character_BP_C.FireChargedLaser
	 */
	struct ASpaceDolphin_Character_BP_C_FireChargedLaser_Params
	{
	public:
		struct FVector                                             Dir;                                                     // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
