#pragma once

/**
 * Name: Ark_Survival_Evolved
 * Version: Patch_358.3
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Microraptor_AIController_BP.Microraptor_AIController_BP_C.Is Target Good
	 */
	struct AMicroraptor_AIController_BP_C_IsTargetGood_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class AMicroraptor_Character_BP_C*                         Microraptor;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Microraptor_AIController_BP.Microraptor_AIController_BP_C.BPGetTargetingDesire
	 */
	struct AMicroraptor_AIController_BP_C_BPGetTargetingDesire_Params
	{
	public:
		class AActor*                                              forTarget;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ForTargetingDesireValue;                                 // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Microraptor_AIController_BP.Microraptor_AIController_BP_C.UserConstructionScript
	 */
	struct AMicroraptor_AIController_BP_C_UserConstructionScript_Params
	{	};

	/**
	 * Function Microraptor_AIController_BP.Microraptor_AIController_BP_C.ExecuteUbergraph_Microraptor_AIController_BP
	 */
	struct AMicroraptor_AIController_BP_C_ExecuteUbergraph_Microraptor_AIController_BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
