#pragma once

/**
 * Name: Ark_Survival_Evolved
 * Version: Patch_358.3
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass StructureStatsPanel.StructureStatsPanel_C
	 * Size -> 0x0088 (FullSize[0x0930] - InheritedSize[0x08A8])
	 */
	class UStructureStatsPanel_C : public UStatsPanelWidget_Structure
	{
	public:
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_1;          // 0x08A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_2;          // 0x08B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_11;         // 0x08B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_3;          // 0x08C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_4;          // 0x08C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_31;         // 0x08D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_5;          // 0x08D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_6;          // 0x08E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_7;          // 0x08E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_8;          // 0x08F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UDataListEntryWidgetPrimalItem_StatEquipped_C*       DataListEntryWidgetPrimalItem_StatEquipped_C_9;          // 0x08F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UStructureStatWidget_C*                              HealthStatWidget;                                        // 0x0900(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 MultiUseButton1;                                         // 0x0908(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 MultiUseButton2;                                         // 0x0910(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 MultiUseButton3;                                         // 0x0918(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UStructureStatWidget_C*                              StorageStatWidget;                                       // 0x0920(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UStructureStatWidget_C*                              WeightStatWidget;                                        // 0x0928(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor

	public:
		void ExecuteUbergraph_StructureStatsPanel(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
